bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA8A.xml
                <module name="TC8">
                    <instance name="TC0" caption="Timer/Counter, 8-bit">
                        <register-group name="TC0" name-in-module="TC0" offset="0x00" address-space="data"
                                        caption="Timer/Counter, 8-bit"/>
                        <signals>
                            <signal group="T" function="default" pad="PD4"/>
                        </signals>
                    </instance>
                </module>
                <module name="TC16">
                    <instance name="TC1" caption="Timer/Counter, 16-bit">
                        <register-group name="TC1" name-in-module="TC1" offset="0x00" address-space="data"
                                        caption="Timer/Counter, 16-bit"/>
                        <signals>
                            <signal group="OCA" function="default" pad="PB1"/>
                            <signal group="OCB" function="default" pad="PB2"/>
                            <signal group="T" function="default" pad="PD5"/>
                            <signal group="ICP" function="default" pad="PB0"/>
                        </signals>
                    </instance>
                </module>
                <module name="TC8_ASYNC">
                    <instance name="TC2" caption="Timer/Counter, 8-bit Async">
                        <register-group name="TC2" name-in-module="TC2" offset="0x00" address-space="data"
                                        caption="Timer/Counter, 8-bit Async"/>
                        <signals>
                            <signal group="OC" function="default" pad="PB3"/>
                        </signals>
                    </instance>
                </module>
                <module name="USART">
                    <instance name="USART" caption="USART">
                        <register-group name="USART" name-in-module="USART" offset="0x00" address-space="data"
                                        caption="USART"/>
                        <signals>
                            <signal group="RXD" function="default" pad="PD0"/>
                            <signal group="TXD" function="default" pad="PD1"/>
                            <signal group="XCK" function="default" pad="PD4"/>
                        </signals>
                    </instance>
                </module>
                <module name="TWI">
                    <instance name="TWI" caption="Two Wire Serial Interface">
                        <register-group name="TWI" name-in-module="TWI" offset="0x00" address-space="data"
                                        caption="Two Wire Serial Interface"/>
                        <signals>
                            <signal group="SDA" function="default" pad="PC4"/>
                            <signal group="SCL" function="default" pad="PC5"/>
                        </signals>
                    </instance>
                </module>
                <module name="WDT">
                    <instance name="WDT" caption="Watchdog Timer">
                        <register-group name="WDT" name-in-module="WDT" offset="0x00" address-space="data"
                                        caption="Watchdog Timer"/>
                    </instance>
                </module>
                <module name="PORT">
                    <instance name="PORTB" caption="I/O Port">
                        <register-group name="PORTB" name-in-module="PORTB" offset="0x00" address-space="data"
                                        caption="I/O Port"/>
                        <signals>
                            <signal group="P" function="default" pad="PB0" index="0"/>
                            <signal group="P" function="default" pad="PB1" index="1"/>
                            <signal group="P" function="default" pad="PB2" index="2"/>
                            <signal group="P" function="default" pad="PB3" index="3"/>
                            <signal group="P" function="default" pad="PB4" index="4"/>
                            <signal group="P" function="default" pad="PB5" index="5"/>
                            <signal group="P" function="default" pad="PB6" index="6"/>
                            <signal group="P" function="default" pad="PB7" index="7"/>
                        </signals>
                    </instance>
                    <instance name="PORTC" caption="I/O Port">
                        <register-group name="PORTC" name-in-module="PORTC" offset="0x00" address-space="data"
                                        caption="I/O Port"/>
                        <signals>
                            <signal group="P" function="default" pad="PC0" index="0"/>
                            <signal group="P" function="default" pad="PC1" index="1"/>
                            <signal group="P" function="default" pad="PC2" index="2"/>
                            <signal group="P" function="default" pad="PC3" index="3"/>
                            <signal group="P" function="default" pad="PC4" index="4"/>
                            <signal group="P" function="default" pad="PC5" index="5"/>
                            <signal group="P" function="default" pad="PC6" index="6"/>
                        </signals>
                    </instance>
                    <instance name="PORTD" caption="I/O Port">
                        <register-group name="PORTD" name-in-module="PORTD" offset="0x00" address-space="data"
                                        caption="I/O Port"/>
                        <signals>
                            <signal group="P" function="default" pad="PD0" index="0"/>
                            <signal group="P" function="default" pad="PD1" index="1"/>
                            <signal group="P" function="default" pad="PD2" index="2"/>
                            <signal group="P" function="default" pad="PD3" index="3"/>
                            <signal group="P" function="default" pad="PD4" index="4"/>
                            <signal group="P" function="default" pad="PD5" index="5"/>
                            <signal group="P" function="default" pad="PD6" index="6"/>
                            <signal group="P" function="default" pad="PD7" index="7"/>
                        </signals>
                    </instance>
                </module>
                <module name="EEPROM">
                    <instance name="EEPROM" caption="EEPROM">
                        <register-group name="EEPROM" name-in-module="EEPROM" offset="0x00" address-space="data"
                                        caption="EEPROM"/>
                    </instance>
                </module>
